src/cf/Documents/CRM_УстановкаИспользуемыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_УстановкаИспользуемыхПоказателей</Name>
			<Comment>Соглашение об используемых показателях планирования</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRM_ИспользуемыеКлючевыеПоказатели</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателяМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыУстановкиИспользуемыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПоказатели</Name>
					<Comment>Используемые показатели планирования</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Comment>Показатель планирования</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонуса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателяМаксимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Менеджеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/CRM_ИспользуемыеКлючевыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_ИспользуемыеКлючевыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБонуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/CRM_УстановкаИспользуемыхПоказателей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = НСтр("ru = 'Установка показателя'")+": "+Данные.Ссылка.Показатель + "/" + Данные.Ссылка.Исполнитель + "/" + Данные.Ссылка.СтатусДокумента;
КонецПроцедуры

Процедура ПерепровестиУстановкиПоказателейСКратностью() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_УстановкаИспользуемыхПоказателей.Ссылка,
	                      |	CRM_УстановкаИспользуемыхПоказателей.ЗначениеПоказателя,
	                      |	CRM_УстановкаИспользуемыхПоказателей.ЗначениеПоказателяМаксимум,
	                      |	CRM_УстановкаИспользуемыхПоказателей.Показатель.КратностьЗначений КАК КратностьЗначений,
	                      |	CRM_УстановкаИспользуемыхПоказателей.Показатель.ДробнаяЧасть КАК ДробнаяЧасть,
	                      |	CRM_УстановкаИспользуемыхПоказателей.Показатель.ПериодАнализа КАК ПериодАнализа
	                      |ИЗ
	                      |	Документ.CRM_УстановкаИспользуемыхПоказателей КАК CRM_УстановкаИспользуемыхПоказателей
	                      |ГДЕ
	                      |	CRM_УстановкаИспользуемыхПоказателей.Показатель.КратностьЗначений <> ""НеИзменять""
	                      |	И CRM_УстановкаИспользуемыхПоказателей.Проведен");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.CRM_ИспользуемыеКлючевыеПоказатели.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если Выборка.КратностьЗначений = "Тысячи" Тогда	
			КратностьЗначений = 1000; 
		ИначеЕсли Выборка.КратностьЗначений = "Миллионы" Тогда	
			КратностьЗначений = 1000000;	
		КонецЕсли;
		
		Если Выборка.ДробнаяЧасть = "Целое" Тогда
			ДробнаяЧасть = 0;
		ИначеЕсли Выборка.ДробнаяЧасть = "Десятые" Тогда	
			ДробнаяЧасть = 1; 
		ИначеЕсли Выборка.ДробнаяЧасть = "Сотые" Тогда	
			ДробнаяЧасть = 2;	
		ИначеЕсли Выборка.ДробнаяЧасть = "Тысячные" Тогда	
			ДробнаяЧасть = 3;	
		КонецЕсли;
		
		Если Выборка.ПериодАнализа = "Месяц" Тогда
			
			ЗначениеДень = Выборка.ЗначениеПоказателя * КратностьЗначений / НаборЗаписей.Количество();
			ЗначениеМаксимумДень = Выборка.ЗначениеПоказателяМаксимум * КратностьЗначений / НаборЗаписей.Количество();
			
			ОкругленноеДень = Окр(ЗначениеДень, ДробнаяЧасть, 1);
			ОкругленноеМаксимумДень = Окр(ЗначениеМаксимумДень, ДробнаяЧасть, 1);
			
			Разница = ЗначениеДень - ОкругленноеДень;
			РазницаМаксимум = ЗначениеМаксимумДень - ОкругленноеМаксимумДень;
			
			НакопленноеОтклонение = 0;
			НакопленноеМаксимумОтклонение = 0;
			
			СчДней = 0;
			Для Каждого Движение Из НаборЗаписей Цикл
				СчДней = СчДней + 1;
				НакопленноеОтклонение = НакопленноеОтклонение + Разница;
				НакопленноеМаксимумОтклонение = НакопленноеМаксимумОтклонение + РазницаМаксимум;
				
				Если СчДней = НаборЗаписей.Количество() Тогда
					Движение.ЗначениеПоказателя = ОкругленноеДень + НакопленноеОтклонение;
					Движение.ЗначениеПоказателяМаксимум = ОкругленноеМаксимумДень + НакопленноеМаксимумОтклонение;
				Иначе	
					Если НакопленноеОтклонение >= 1 Тогда
						Движение.ЗначениеПоказателя = ОкругленноеДень + 1;
						НакопленноеОтклонение = НакопленноеОтклонение - 1;
					ИначеЕсли НакопленноеОтклонение <= -1 Тогда
						Движение.ЗначениеПоказателя = ОкругленноеДень - 1;
						НакопленноеОтклонение = НакопленноеОтклонение + 1;
					Иначе
						Движение.ЗначениеПоказателя = ОкругленноеДень;
					КонецЕсли;	
					
					Если НакопленноеМаксимумОтклонение >= 1 Тогда
						Движение.ЗначениеПоказателяМаксимум = ОкругленноеМаксимумДень + 1;
						НакопленноеМаксимумОтклонение = НакопленноеМаксимумОтклонение - 1;
					ИначеЕсли НакопленноеМаксимумОтклонение <= -1 Тогда
						Движение.ЗначениеПоказателяМаксимум = ОкругленноеМаксимумДень - 1;
						НакопленноеМаксимумОтклонение = НакопленноеМаксимумОтклонение + 1;
					Иначе
						Движение.ЗначениеПоказателяМаксимум = ОкругленноеМаксимумДень;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		ИначеЕсли Выборка.ПериодАнализа = "День" Тогда
			
			Для Каждого СтрокаДней Из НаборЗаписей Цикл
				Движение.ЗначениеПоказателя = Выборка.ЗначениеПоказателя * КратностьЗначений;
				Движение.ЗначениеПоказателяМаксимум = Выборка.ЗначениеПоказателяМаксимум * КратностьЗначений;
			КонецЦикла;
			
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
